In [3]:
import pandas
pandas.__version__

'1.0.4'

In [4]:
import numpy as np
import pandas as pd

In [5]:
counts = pd.Series([12,34,5,566,666])
counts

0     12
1     34
2      5
3    566
4    666
dtype: int64

In [6]:
counts.values

array([ 12,  34,   5, 566, 666])

In [7]:
counts.index

RangeIndex(start=0, stop=5, step=1)

In [14]:
fruits = pd.Series([12,34,5,566,666],  
    index = ['mango','apple','banaana','papaya','jackfruit'])

fruits

mango         12
apple         34
banaana        5
papaya       566
jackfruit    666
dtype: int64

In [16]:
fruits['papaya']

566

In [18]:
fruits[0]

12

In [20]:
fruits.name = 'counts'
fruits.index.name = 'yummy fruits'
fruits

yummy fruits
mango         12
apple         34
banaana        5
papaya       566
jackfruit    666
Name: counts, dtype: int64

In [21]:
np.log(fruits)

yummy fruits
mango        2.484907
apple        3.526361
banaana      1.609438
papaya       6.338594
jackfruit    6.501290
Name: counts, dtype: float64

In [22]:
fruits[fruits>600]

yummy fruits
jackfruit    666
Name: counts, dtype: int64

In [24]:
fruits_dict ={'apple':34,'mango':12,'banana':5}
print(fruits_dict)
pd.Series(fruits_dict)

{'apple': 34, 'mango': 12, 'banana': 5}

apple     34
mango     12
banana     5
dtype: int64

In [165]:
data ={"Province":['AP','AP','SD','SD','EL'],
       "year":[2001,2002,2003,2005,2006],
       "Date":[23,20,13,12,24]}
print(data)
data = pd.DataFrame(data)
data

{'Province': ['AP', 'AP', 'SD', 'SD', 'EL'], 'year': [2001, 2002, 2003, 2005, 2006], 'Date': [23, 20, 13, 12, 24]}

  Province  year  Date
0       AP  2001    23
1       AP  2002    20
2       SD  2003    13
3       SD  2005    12
4       EL  2006    24

In [166]:
df = pd.DataFrame(data,columns=["Date","year","Province"])
df

   Date  year Province
0    23  2001       AP
1    20  2002       AP
2    13  2003       SD
3    12  2005       SD
4    24  2006       EL

In [167]:
df ['diif'] = df.year/df.Date
df

   Date  year Province        diif
0    23  2001       AP   87.000000
1    20  2002       AP  100.100000
2    13  2003       SD  154.076923
3    12  2005       SD  167.083333
4    24  2006       EL   83.583333

In [168]:
df['newdata'] = pd.Series(range(5),index =[0,1,2,3,4])
df

   Date  year Province        diif  newdata
0    23  2001       AP   87.000000        0
1    20  2002       AP  100.100000        1
2    13  2003       SD  154.076923        2
3    12  2005       SD  167.083333        3
4    24  2006       EL   83.583333        4

In [169]:
df.to_dict()

{'Date': {0: 23, 1: 20, 2: 13, 3: 12, 4: 24},
 'Province': {0: 'AP', 1: 'AP', 2: 'SD', 3: 'SD', 4: 'EL'},
 'diif': {0: 87.0,
  1: 100.1,
  2: 154.07692307692307,
  3: 167.08333333333334,
  4: 83.58333333333333},
 'newdata': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4},
 'year': {0: 2001, 1: 2002, 2: 2003, 3: 2005, 4: 2006}}

In [170]:
pd.DataFrame(df.to_dict())

   Date  year Province        diif  newdata
0    23  2001       AP   87.000000        0
1    20  2002       AP  100.100000        1
2    13  2003       SD  154.076923        2
3    12  2005       SD  167.083333        3
4    24  2006       EL   83.583333        4

In [171]:
data = [{'a': i,'b':10*i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [36]:
pd.DataFrame([{'a':1,'b':3},{'c':4,'d':6}])

     a    b    c    d
0  1.0  3.0  NaN  NaN
1  NaN  NaN  4.0  6.0

In [40]:
df =pd.DataFrame([{'a':1,'b':3},{'c':4,'d':6}])
df = df.to_dict()
df

{'a': {0: 1.0, 1: nan},
 'b': {0: 3.0, 1: nan},
 'c': {0: nan, 1: 4.0},
 'd': {0: nan, 1: 6.0}}

In [45]:
pd.DataFrame(np.random.randint(2,20),
             columns = ['a','b','c'],
             index = [1,2,3])

   a  b  c
1  7  7  7
2  7  7  7
3  7  7  7

In [46]:
ind = pd.Index([23,89,67,56])
ind

Int64Index([23, 89, 67, 56], dtype='int64')

In [47]:
ind[1]

89

In [48]:
ind[::]

Int64Index([23, 89, 67, 56], dtype='int64')

In [49]:
ind[2:3:2]

Int64Index([67], dtype='int64')

In [51]:
print(ind.size,ind.shape,ind.ndim,ind.dtype)

4 (4,) 1 int64

In [52]:
ind[1] = 9

TypeError: ignored

In [54]:
rng =np.random.RandomState(20)
ser = pd.Series(rng.randint(0,10,4))
ser

0    3
1    9
2    4
3    6
dtype: int64

In [57]:
dfr = pd.DataFrame(rng.randint(0,10,(5,4)),
                   columns =['a','b','c','d'])
dfr

   a  b  c  d
0  7  2  0  6
1  8  5  3  0
2  6  6  0  9
3  5  7  5  2
4  6  9  3  3

In [58]:
np.exp(ser)

0      20.085537
1    8103.083928
2      54.598150
3     403.428793
dtype: float64

In [59]:
np.sin(dfr*np.pi/4)

              a         b         c         d
0 -7.071068e-01  1.000000  0.000000 -1.000000
1 -2.449294e-16 -0.707107  0.707107  0.000000
2 -1.000000e+00 -1.000000  0.000000  0.707107
3 -7.071068e-01 -0.707107 -0.707107  1.000000
4 -1.000000e+00  0.707107  0.707107  0.707107

In [65]:
area = pd.Series({"BB":89899,"vv":8900000,"wif":90000},name ='area')
population = pd.Series({"vv":9000,"alla":67889,"kiki":9898},name='population')
print(area)
population

BB       89899
vv     8900000
wif      90000
Name: area, dtype: int64

vv       9000
alla    67889
kiki     9898
Name: population, dtype: int64

In [66]:
population/area

BB           NaN
alla         NaN
kiki         NaN
vv      0.001011
wif          NaN
dtype: float64

In [68]:
area.index|population.index

Index(['BB', 'alla', 'kiki', 'vv', 'wif'], dtype='object')

In [70]:
A = pd.Series([1,4,8],index=[0,1,2,])
b = pd.Series([1,9,5],index =[1,2,3,])
print(A)
print(b)
A+b

0    1
1    4
2    8
dtype: int64
1    1
2    9
3    5
dtype: int64

0     NaN
1     5.0
2    17.0
3     NaN
dtype: float64

In [71]:
A.add(b,fill_value=0)

0     1.0
1     5.0
2    17.0
3     5.0
dtype: float64

In [172]:
df

   Date  year Province        diif  newdata
0    23  2001       AP   87.000000        0
1    20  2002       AP  100.100000        1
2    13  2003       SD  154.076923        2
3    12  2005       SD  167.083333        3
4    24  2006       EL   83.583333        4

In [177]:
df2 = pd.DataFrame({"Province":[ "AP","SD","EL"],"population" :["1000000","2000000","3000000"]})
df2

  Province population
0       AP    1000000
1       SD    2000000
2       EL    3000000

In [178]:
df.merge(df2)

   Date  year Province        diif  newdata population
0    23  2001       AP   87.000000        0    1000000
1    20  2002       AP  100.100000        1    1000000
2    13  2003       SD  154.076923        2    2000000
3    12  2005       SD  167.083333        3    2000000
4    24  2006       EL   83.583333        4    3000000

In [179]:
df3 = pd.DataFrame({"province" : ["SD","EL"],"population" : [4500000,5600003]})
df3
df.merge(df3,right_on= 'province',left_on= 'Province')

   Date  year Province        diif  newdata province  population
0    13  2003       SD  154.076923        2       SD     4500000
1    12  2005       SD  167.083333        3       SD     4500000
2    24  2006       EL   83.583333        4       EL     5600003

In [182]:
df4 = pd.DataFrame({"Province" : ["AP","SD","UT"],"population" : [67777777,4500000,5600003]})
df4
df.merge(df4,how = 'outer')

   Date    year Province        diif  newdata  population
0  23.0  2001.0       AP   87.000000      0.0  67777777.0
1  20.0  2002.0       AP  100.100000      1.0  67777777.0
2  13.0  2003.0       SD  154.076923      2.0   4500000.0
3  12.0  2005.0       SD  167.083333      3.0   4500000.0
4  24.0  2006.0       EL   83.583333      4.0         NaN
5   NaN     NaN       UT         NaN      NaN   5600003.0

In [183]:
df5 = pd.DataFrame({"Province" : ["AP","SD","AP"],"population" : [67777777,4500000,5000000]})
df
df.merge(df5,how = 'outer')

   Date  year Province        diif  newdata  population
0    23  2001       AP   87.000000        0  67777777.0
1    23  2001       AP   87.000000        0   5000000.0
2    20  2002       AP  100.100000        1  67777777.0
3    20  2002       AP  100.100000        1   5000000.0
4    13  2003       SD  154.076923        2   4500000.0
5    12  2005       SD  167.083333        3   4500000.0
6    24  2006       EL   83.583333        4         NaN

In [184]:
serie_a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
                     index=['a', 'b', 'c', 'd', 'e', 'f'])
serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                 index=['f', 'h', 'v', 'w', 'x', 'z'])

In [185]:
serie_a

a    NaN
b    2.5
c    NaN
d    3.5
e    4.5
f    NaN
dtype: float64

In [186]:
serie_b

f    0.0
h    1.0
v    2.0
w    3.0
x    4.0
z    5.0
dtype: float64

In [187]:
pd.Series(np.where(pd.isnull(serie_a), serie_b, serie_a), index=serie_a.index)

a    0.0
b    2.5
c    2.0
d    3.5
e    4.5
f    5.0
dtype: float64

In [188]:
serie_a.combine_first(serie_b)

a    NaN
b    2.5
c    NaN
d    3.5
e    4.5
f    0.0
h    1.0
v    2.0
w    3.0
x    4.0
z    5.0
dtype: float64